Repository: Tat8y/travel_smartapp
Catalog: lib/l10n/app_*.arb
Languages: si

# choose_prefered_language
source: Choose Your Prefered Language
si: ඔබගේ භාෂාව තෝරන්න

source: Home
si: මීලග

source: Location
si: නිවස

source: Account
si: ගිණුම

source: User Profile
si: පරිශිලක ගිණුම

# first_name_label
source: First Name
si: මුල් නම

# last_name_label
source: Last Name
si: අවසාන නම

# email_label
source: Email Address
si: ඊමෙල් ලිපිනය

source: Password
si: මුරපදය

# confrim_password
source: Confirm Password
si: මුරපදය තහවුරු කරන්න

# wating
source: Waiting
si: රැදී සිටින්න

source: Past Travels
si: පෙර ගමන්

source: Points
si: දීමනා

source: Edit Profile
si: ගිණුම යාවත්කාලීන කරන්න

source: Password don't match
si: මුරපදය නොගැලපේ

source: Login Successful
si: පුරනය වීම සාර්ථකයි

# dont_have_an_account
source: Dont have an Account Yet?
si: තවම ගිණුමක් නැද්ද?

# cannot_be_empty
source: {feild} cannot be Empty
si: {feild} හිස් විය නොහැක

source: Please Enter Valid {feild}
si: කරුණාකර වලංගු {feild} ඇතුලත් කරන්න

# feild_requried
source: {feild} is Requried for {method}
si: {method} වීමට {feild} අවශ්‍ය වේ

source: Congratulations
si: සුභ පැතුම්

source: Your E- Ticket
si: ඔබේ E- ටිකට්පත

source: Goto Home
si: මුල් පිටුවට යන්න

source: Full Name
si: සම්පූර්ණ නම

source: Arrival Time
si: පැමිණීමේ වේලාව

source: Seat
si: ආසනය

source: From
si: සිට

source: To
si: වෙත

source: Select Seat
si: ආසනය තෝරන්න

# continue_label
source: Continue
si: ඉදිරියට

source: Please Select Seat
si: කරුණාකර ආසනය තෝරන්න

source: Available
si: පවතින

source: Selected
si: තෝරාගත්

source: Unavailable
si: ලබා ගත නොහැකි

source: Your Seat
si: ඔබේ ආසනය

source: Total Price
si: මුළු මුදල

source: Confirm Order
si: ඇණවුම තහවුරු කරන්න

source: You Need To Total Pay
si: ගෙවිය යුතු මුළු මුදල

source: Notice
si: දැනුම්දීම

# payment_notice
source: You can do your transactions by credit card or debit card. Completely secure with end-to-end encryption. We do not store your card details and do not give them to third parties.
si: ඔබට ක්‍රෙඩිට් කාඩ් හෝ ඩෙබිට් කාඩ් මගින් ඔබේ ගනුදෙනු කළ හැක. end-to-end Encryption තාක්ෂණය මගින් ඔබේ මිලදී ගැනීම් සුරක්ෂිත කර ඇත. අපි ඔබගේ කාඩ්පත් විස්තර ගබඩා නොකරන අතර ඒවා තෙවන පාර්ශවයන්ට ලබා නොදේ.

source: Train
si: දුම්රිය

# number_of_seats
source: Number of Seat
si: ආසන අංකය

source: Coupen Code
si: කූපන් කේතය

source: Discount
si: වට්ටම්

# payment_error_header
source: Payment Cancelled
si: ගෙවීම අවලංගු කරන ලදී

# payment_succesfull_header
source: Payment Successful
si: ගෙවීම සාර්ථකයි

# payment_succesfull_body
source: Payment Error Body
si: ඔබගේ ගෙවීම සාර්ථකයි.

# close
source: CLSOE
si: ඉවත් වන්න

source: OK
si: හරි

source: Next
si: ඊළඟ

source: Sign Up
si: ලියාපදිංචි වන්න

source: Sign In
si: පුරන්න

source: Login
si: පුරන්න

source: Update
si: යාවත්කාලීන කරන්න

source: Register
si: ලියාපදිංචි වන්න

source: Logout
si: පිටවීම

source: Checkout
si: ගෙවීම පරික්ෂා කරන්න

source: Pay
si: ගෙවන්න

# home_header
source: Where do you Want to Go?
si: ඔබට යාමට අවශ්‍ය කොහේද?

source: Available Trains
si: පවතින දුම්රිය

source: No Data
si: දත්ත නැත
